front-end/paginator.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-08-06 Tue 02:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>分页(Pagination)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="yaowuer">
<link rel='stylesheet' href='/asset/common.css' />



</head>
<body>
<div id="content">
<header>
<h1 class="title">分页(Pagination)</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7e1b353">1. Paginator 示例</a></li>
<li><a href="#orgb43f094">2. Paginator 类使用方法</a></li>
<li><a href="#org05a8f64">3. Paginator 的封装</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org7e1b353" class="outline-2">
<h2 id="org7e1b353"><span class="section-number-2">1</span> Paginator 示例</h2>
<div class="outline-text-2" id="text-1">
<p>
这是我们的自己定义的分页类:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> com.nf.howdoyoudo.<span class="org-constant">pagination</span>;

<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">ArrayList</span>;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">List</span>;


<span class="org-doc">/**</span>
<span class="org-doc"> * &#23553;&#35013;&#20998;&#39029;&#21151;&#33021;</span>
<span class="org-doc"> *</span>
<span class="org-doc"> * &#20351;&#29992;&#26041;&#27861;&#65306;</span>
<span class="org-doc"> * 1. &#33719;&#21462;&#29992;&#25143;&#21442;&#25968;&#65292;&#24182;&#20351;&#29992;&#36825;&#20123;&#21442;&#25968;&#21019;&#24314; </span><span class="org-doc"><span class="org-constant">{@link Paginator}</span></span><span class="org-doc"> &#23545;&#35937;</span>
<span class="org-doc"> * 2. &#26597;&#35810;&#25968;&#25454;&#24211;&#65292;&#24471;&#21040;&#35760;&#24405;&#24635;&#25968;&#65292;&#20445;&#23384;&#21040; </span><span class="org-doc"><span class="org-constant">{@link Paginator}</span></span><span class="org-doc"> &#23545;&#35937;</span>
<span class="org-doc"> * 3. &#26597;&#35810;&#25968;&#25454;&#24211;&#65292;&#24471;&#21040;&#20998;&#39029;&#25968;&#25454;&#65292;&#20445;&#23384;&#21040; </span><span class="org-doc"><span class="org-constant">{@link Paginator}</span></span><span class="org-doc"> &#23545;&#35937;&#12290;&#21487;&#20197;&#36890;&#36807; </span><span class="org-doc"><span class="org-constant">{@link Paginator#getOffset()}</span></span><span class="org-doc"> &#24471;&#21040;&#25968;&#25454;&#30340;&#24320;&#22987;&#24207;&#21495;&#12290;</span>
<span class="org-doc"> * 4. &#20445;&#23384; </span><span class="org-doc"><span class="org-constant">{@link Paginator}</span></span><span class="org-doc"> &#21040; request &#25110; session &#20013;&#65292;&#29992;&#20110;&#39029;&#38754;&#28210;&#26579;&#12290;</span>
<span class="org-doc"> * 5. &#20351;&#29992;&#20445;&#23384;&#30340; </span><span class="org-doc"><span class="org-constant">{@link Paginator}</span></span><span class="org-doc"> &#23545;&#35937;&#28210;&#26579;&#39029;&#38754;&#65292;&#21487;&#20197;&#20351;&#29992; </span><span class="org-doc"><span class="org-constant">{@link Paginator#outputPageNav(String, String, boolean, boolean)}</span></span><span class="org-doc"> &#30452;&#25509;&#36755;&#20986;&#39029;&#30721;&#23548;&#33322;</span>
<span class="org-doc"> *</span>
<span class="org-doc"> * </span><span class="org-doc"><span class="org-constant">&lt;code&gt;</span></span>
<span class="org-doc"> *</span>
<span class="org-doc"> *     // in the servlet</span>
<span class="org-doc"> *     Paginator pager = new Paginator(&#24403;&#21069;&#39029;, &#27599;&#39029;&#26174;&#31034;&#25968;&#30446;, &#23548;&#33322;&#26639;&#39029;&#25968;);</span>
<span class="org-doc"> *</span>
<span class="org-doc"> *     pager.setRowCount(dao.count());</span>
<span class="org-doc"> *     pager.setData(dao.findAll(page.getOffset(), page.getSize());</span>
<span class="org-doc"> *</span>
<span class="org-doc"> *     request.addAttribute("pager", pager);</span>
<span class="org-doc"> *</span>
<span class="org-doc"> *</span>
<span class="org-doc"> *     // in the jsp</span>
<span class="org-doc"> *     </span><span class="org-doc"><span class="org-constant">&lt;style&gt;</span></span>
<span class="org-doc"> *         #pagination {}</span>
<span class="org-doc"> *     </span><span class="org-doc"><span class="org-constant">&lt;/style&gt;</span></span>
<span class="org-doc"> *     </span><span class="org-doc"><span class="org-constant">&lt;table&gt;</span></span>
<span class="org-doc"> *         </span><span class="org-doc"><span class="org-warning">&lt;</span></span><span class="org-doc">%-- &#25968;&#25454;&#23637;&#31034; --%</span><span class="org-doc"><span class="org-warning">&gt;</span></span>
<span class="org-doc"> *     </span><span class="org-doc"><span class="org-constant">&lt;/table&gt;</span></span>
<span class="org-doc"> *     </span><span class="org-doc"><span class="org-constant">&lt;nav&gt;</span></span>
<span class="org-doc"> *         </span><span class="org-doc"><span class="org-warning">&lt;</span></span><span class="org-doc">%-- &#39029;&#30721;&#23548;&#33322;&#26639; --%</span><span class="org-doc"><span class="org-warning">&gt;</span></span>
<span class="org-doc"> *         ${page.outputPageNav("/url", "pageno", true, true)}</span>
<span class="org-doc"> *     </span><span class="org-doc"><span class="org-constant">&lt;/nav&gt;</span></span>
<span class="org-doc"> *</span>
<span class="org-doc"> * </span><span class="org-doc"><span class="org-constant">&lt;/code&gt;</span></span>
<span class="org-doc"> * </span><span class="org-doc"><span class="org-constant">@param</span></span><span class="org-doc"> </span><span class="org-doc"><span class="org-constant">&lt;T&gt;</span></span>
<span class="org-doc"> */</span>
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Paginator</span>&lt;<span class="org-type">T</span>&gt; {

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#20174;&#29992;&#25143;&#22788;&#33719;&#21462;&#30340;&#21442;&#25968;</span>
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">current</span> = 1;   <span class="org-comment-delimiter">// </span><span class="org-comment">&#24403;&#21069;&#39029;&#30721;</span>
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">pageSize</span> = 10; <span class="org-comment-delimiter">// </span><span class="org-comment">&#27599;&#39029;&#25968;&#30446;</span>
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">linkSize</span> = 5;  <span class="org-comment-delimiter">// </span><span class="org-comment">&#23548;&#33322;&#26639;&#39029;&#30721;&#25968;&#30446;</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#20174;&#25968;&#25454;&#24211;&#26597;&#35810;&#21040;&#30340;&#25968;&#25454;</span>
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">rowCount</span>;      <span class="org-comment-delimiter">// </span><span class="org-comment">&#34920;&#31034;&#24635;&#20849;&#26377;&#22810;&#23569;&#26465;&#65307;</span>
    <span class="org-keyword">private</span> <span class="org-type">List</span>&lt;<span class="org-type">T</span>&gt; <span class="org-variable-name">data</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;&gt;();  <span class="org-comment-delimiter">// </span><span class="org-comment">&#33719;&#21462;&#21040;&#30340;&#25968;&#25454;</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#26681;&#25454;&#19978;&#38754;&#35745;&#31639;&#20986;&#30340;&#25968;&#25454;</span>
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">pageCount</span>;     <span class="org-comment-delimiter">// </span><span class="org-comment">&#24635;&#20849;&#26377;&#22810;&#23569;&#39029;</span>
    <span class="org-keyword">private</span> <span class="org-type">List</span>&lt;<span class="org-type">Integer</span>&gt; <span class="org-variable-name">links</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;&gt;();  <span class="org-comment-delimiter">// </span><span class="org-comment">&#23548;&#33322;&#26465;&#35201;&#26174;&#31034;&#30340;&#39029;&#30721;</span>



    <span class="org-comment-delimiter">/* </span><span class="org-comment">Constructors */</span>
    <span class="org-keyword">public</span> <span class="org-function-name">Paginator</span>() {
    }

    <span class="org-keyword">public</span> <span class="org-function-name">Paginator</span>(<span class="org-type">int</span> <span class="org-variable-name">current</span>, <span class="org-type">int</span> <span class="org-variable-name">pageSize</span>, <span class="org-type">int</span> <span class="org-variable-name">linkSize</span>) {
        <span class="org-keyword">this</span>.current = current;
        <span class="org-keyword">this</span>.pageSize = pageSize;
        <span class="org-keyword">this</span>.linkSize = linkSize;
    }



    <span class="org-comment-delimiter">/* </span><span class="org-comment">Accessors */</span>
    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getCurrent</span>() {
        <span class="org-keyword">return</span> current;
    }

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setCurrent</span>(<span class="org-type">int</span> <span class="org-variable-name">current</span>) {
        <span class="org-keyword">this</span>.current = current;
    }

    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getPageSize</span>() {
        <span class="org-keyword">return</span> pageSize;
    }

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setPageSize</span>(<span class="org-type">int</span> <span class="org-variable-name">pageSize</span>) {
        <span class="org-keyword">this</span>.pageSize = pageSize;
    }

    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getLinkSize</span>() {
        <span class="org-keyword">return</span> linkSize;
    }

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setLinkSize</span>(<span class="org-type">int</span> <span class="org-variable-name">linkSize</span>) {
        <span class="org-keyword">this</span>.linkSize = linkSize;
    }

    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getRowCount</span>() {
        <span class="org-keyword">return</span> rowCount;
    }

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setRowCount</span>(<span class="org-type">int</span> <span class="org-variable-name">rowCount</span>) {
        <span class="org-keyword">this</span>.rowCount = rowCount;
        <span class="org-keyword">this</span>.pageCount = (rowCount + pageSize - 1) / pageSize;
        calcLinks();
    }

    <span class="org-keyword">public</span> <span class="org-type">List</span>&lt;<span class="org-type">T</span>&gt; <span class="org-function-name">getData</span>() {
        <span class="org-keyword">return</span> data;
    }

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setData</span>(<span class="org-type">List</span>&lt;<span class="org-type">T</span>&gt; <span class="org-variable-name">data</span>) {
        <span class="org-keyword">this</span>.data = data;
    }

    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getOffset</span>() {
        <span class="org-keyword">return</span> (<span class="org-keyword">this</span>.current - 1) * <span class="org-keyword">this</span>.pageSize + 1;
    }

    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getPageCount</span>() {
        <span class="org-keyword">return</span> pageCount;
    }

    <span class="org-keyword">public</span> <span class="org-type">List</span>&lt;<span class="org-type">Integer</span>&gt; <span class="org-function-name">getLinks</span>() {
        <span class="org-keyword">return</span> links;
    }

    <span class="org-doc">/**</span>
<span class="org-doc">     * &#35745;&#31639;/&#21047;&#26032;&#23548;&#33322;&#26639;&#35201;&#26174;&#31034;&#30340;&#39029;&#30721;</span>
<span class="org-doc">     */</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">calcLinks</span>() {
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#26681;&#25454;&#19979;&#38754;&#26465;&#20214;&#35745;&#31639;&#65306;</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">1. &#24403;&#21069;&#39029; current</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">2. &#24635;&#39029;&#25968; pageCount</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">3. &#26174;&#31034;&#25968;&#30446; linkSize</span>
        <span class="org-type">int</span> <span class="org-variable-name">halfLinkSize</span> = <span class="org-keyword">this</span>.linkSize/2;
        <span class="org-type">int</span> <span class="org-variable-name">startPage</span> = Math.max(<span class="org-keyword">this</span>.current - halfLinkSize, 1);
        <span class="org-type">int</span> <span class="org-variable-name">endPage</span> = Math.min(<span class="org-keyword">this</span>.current + halfLinkSize, <span class="org-keyword">this</span>.pageCount);

        <span class="org-keyword">if</span>(endPage - startPage &lt; <span class="org-keyword">this</span>.linkSize - 1) {
            <span class="org-keyword">if</span>(startPage == 1) {
                endPage = Math.min(startPage + <span class="org-keyword">this</span>.linkSize - 1, <span class="org-keyword">this</span>.pageCount);
            } <span class="org-keyword">else</span> {
                startPage = Math.max(endPage - <span class="org-keyword">this</span>.linkSize + 1, 1);
            }
        }
        <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = startPage; i &lt;= endPage; i++) {
            <span class="org-keyword">this</span>.links.add(i);
        }
    }

    <span class="org-doc">/**</span>
<span class="org-doc">     * &#36755;&#20986;&#23548;&#33322;&#26465;&#30340; html</span>
<span class="org-doc">     *</span>
<span class="org-doc">     * &#31616;&#21333;&#23553;&#35013;&#65292;&#21487;&#26681;&#25454;&#38656;&#27714;&#33258;&#24049;&#23450;&#21046;</span>
<span class="org-doc">     *</span>
<span class="org-doc">     * </span><span class="org-doc"><span class="org-constant">@param</span></span><span class="org-doc"> url &#35831;&#27714;&#36335;&#24452;</span>
<span class="org-doc">     * </span><span class="org-doc"><span class="org-constant">@param</span></span><span class="org-doc"> pagenoParam &#34920;&#31034;&#35831;&#27714;&#20013;&#39029;&#30721;&#30340;&#23383;&#27573;&#21517;&#31216;</span>
<span class="org-doc">     * </span><span class="org-doc"><span class="org-constant">@param</span></span><span class="org-doc"> isFirstLast &#26159;&#21542;&#26174;&#31034;&#39318;&#39029;&#26411;&#39029;</span>
<span class="org-doc">     * </span><span class="org-doc"><span class="org-constant">@param</span></span><span class="org-doc"> isPrevNext  &#26159;&#21542;&#26174;&#31034;&#19978;&#39029;&#19979;&#39029;</span>
<span class="org-doc">     * </span><span class="org-doc"><span class="org-constant">@return</span></span><span class="org-doc"> &#20998;&#39029;&#30340; html &#35821;&#21477;</span>
<span class="org-doc">     */</span>
    <span class="org-keyword">public</span> <span class="org-type">String</span> <span class="org-function-name">outputPageNav</span>(<span class="org-type">String</span> <span class="org-variable-name">url</span>, <span class="org-type">String</span> <span class="org-variable-name">pagenoParam</span>, <span class="org-type">boolean</span> <span class="org-variable-name">isFirstLast</span>, <span class="org-type">boolean</span> <span class="org-variable-name">isPrevNext</span>) {

        <span class="org-type">String</span> <span class="org-variable-name">firstLabel</span> = <span class="org-string">"&#39318;&#39029;"</span>, <span class="org-variable-name">lastLabel</span> = <span class="org-string">"&#26411;&#39029;"</span>, <span class="org-variable-name">prevLabel</span> = <span class="org-string">"?"</span>, <span class="org-variable-name">nextLabel</span> = <span class="org-string">"?"</span>;

        <span class="org-type">String</span> <span class="org-variable-name">normalLink</span> = <span class="org-string">"  &lt;li&gt;&lt;a href='"</span> + url + <span class="org-string">"?"</span> + pagenoParam + <span class="org-string">"=%s'&gt;%s&lt;/a&gt;&lt;/li&gt;\n"</span>;
        <span class="org-type">String</span> <span class="org-variable-name">currentLink</span> = <span class="org-string">"  &lt;li&gt;&lt;a href='#' class='current'&gt;%s&lt;/a&gt;&lt;/li&gt;\n"</span>;
        <span class="org-type">String</span> <span class="org-variable-name">readonlyLink</span> = <span class="org-string">"  &lt;li&gt;&lt;a href='#' class='ro'&gt;%s&lt;/a&gt;&lt;/li&gt;\n"</span>;

        <span class="org-type">StringBuilder</span> <span class="org-variable-name">output</span> = <span class="org-keyword">new</span> <span class="org-type">StringBuilder</span>(<span class="org-string">"&lt;ul id='pagination'&gt;\n"</span>);

        <span class="org-comment-delimiter">// </span><span class="org-comment">&#39318;&#39029;</span>
        <span class="org-keyword">if</span>(isFirstLast) {
            <span class="org-keyword">if</span>(current == 1) {
                output.append(String.format(readonlyLink, firstLabel));
            } <span class="org-keyword">else</span> {
                output.append(String.format(normalLink, 1, firstLabel));
            }
        }

        <span class="org-comment-delimiter">// </span><span class="org-comment">&#19978;&#19968;&#39029;</span>
        <span class="org-keyword">if</span>(isPrevNext) {
            <span class="org-keyword">if</span>(current &lt; 2) {
                output.append(String.format(readonlyLink, prevLabel));
            } <span class="org-keyword">else</span> {
                output.append(String.format(normalLink, current - 1, prevLabel));
            }
        }

        <span class="org-comment-delimiter">// </span><span class="org-comment">&#31532; x &#39029;</span>
        <span class="org-keyword">for</span>(<span class="org-type">Integer</span> <span class="org-variable-name">i</span> : links) {
            <span class="org-keyword">if</span>(current == i) {
                output.append(String.format(currentLink, i));
            } <span class="org-keyword">else</span> {
                output.append(String.format(normalLink, i, i));
            }
        }

        <span class="org-comment-delimiter">// </span><span class="org-comment">&#19979;&#19968;&#39029;</span>
        <span class="org-keyword">if</span>(isPrevNext) {
            <span class="org-keyword">if</span>(current &gt;= pageCount) {
                output.append(String.format(readonlyLink, nextLabel));
            } <span class="org-keyword">else</span> {
                output.append(String.format(normalLink, current + 1, nextLabel));
            }
        }

        <span class="org-comment-delimiter">// </span><span class="org-comment">&#23614;&#39029;</span>
        <span class="org-keyword">if</span>(isFirstLast) {
            <span class="org-keyword">if</span>(current == pageCount) {
                output.append(String.format(readonlyLink, lastLabel));
            } <span class="org-keyword">else</span> {
                output.append(String.format(normalLink, pageCount, lastLabel));
            }
        }

        <span class="org-keyword">return</span> String.valueOf(output.append(<span class="org-string">"&lt;/ul&gt;"</span>));
    }

}
</pre>
</div>
</div>
</section>
